src/intTest/resources/gpas/createPatientDomain.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:psn="http://psn.ttp.ganimed.icmvc.emau.org/"
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <psn:addDomain>
            <domainDTO>
                <alphabet>org.emau.icmvc.ganimed.ttp.psn.alphabets.Symbol32</alphabet>
                <checkDigitClass>org.emau.icmvc.ganimed.ttp.psn.generator.HammingCode</checkDigitClass>
                <comment>PATIENT Domain</comment>
                <name>PATIENT</name>
                <properties>PSN_LENGTH=16;PSN_PREFIX=PSN-PID-;INCLUDE_PREFIX_IN_CHECK_DIGIT_CALCULATION=false;PSNS_DELETABLE=true;MAX_DETECTED_ERRORS=2;</properties>
            </domainDTO>
        </psn:addDomain>
    </soapenv:Body>
    <soapenv:Header/>
</soapenv:Envelope>
